#pragma once

////////////////////////////////////////////////////////////////////////////////
//
/// Объявление класса точки
/**
*/
////////////////////////////////////////////////////////////////////////////////
class Point
{
private:
	double m_x;  /// < координата геометрической точки по оси абсцисс
	double m_y;  /// < координата геометрической точки по оси ординат
	double m_z;  /// < координата геометрической точки по оси аппликат

public:
	/// Конструктор
	Point(double x = 0.0, double y = 0.0 , double z = 0.0);
	/// Метод получения точки по оси абсцисс
	double GetX() const;
	/// Метод получения точки по оси ординат
	double GetY() const;
	/// Метод получения точки по оси аппликат
	double GetZ() const;
	/// Перегрузка метода равенства точек
	bool operator==(const Point& rhs) const;
};