#include "Point.h"
#include <math.h>

//------------------------------------------------------------------------------
/**
   Конструктор
   \param x координата геометрической точки по оси абсцисс
   \param y координата геометрической точки по оси ординат
   \param z координата геометрической точки по оси аппликат
*/
//--- 
Point::Point(double x, double y, double z)
	: m_x(x)
	, m_y(y)
	, m_z(z)
{
}

//------------------------------------------------------------------------------
/**
   Метод получения m_x
*/
//--- 
double Point::GetX() const
{
  return m_x;
}

//------------------------------------------------------------------------------
/**
   Метод получения m_y
*/
//--- 
double Point::GetY() const
{
  return m_y;
}

//------------------------------------------------------------------------------
/**
   Метод получения m_z
*/
//--- 
double Point::GetZ() const
{
  return m_z;
}

//------------------------------------------------------------------------------
/**
   Перегрузка равенства точек
*/
//--- 
bool Point::operator==(const Point& rhs) const
{
  constexpr double eps = 0.00001;
  return (fabs(m_x - rhs.m_x) < eps && fabs(m_y - rhs.m_y) < eps && fabs(m_z - rhs.m_z) < eps);
}